#!/bin/bash
#
#作者：衡钊清
#email：hengzhaoqing@163.com
#
#Centos 系统代理配置
############################################################################################################################################################
############################################################################################################################################################
#配置代理常用格式
#1、有用户名和密码的
#
##### proxy=http://username:password@proxy_ip:port
#
#2、没有用户名和密码的
##### proxy=http://proxy_ip:port
#
############################################################################################################################################################
############################################################################################################################################################
echo "#################################################################"
echo "Centos 代理配置"
echo "#################################################################"
echo "Centos 代理配置注意事项"
echo "1、配置有用户名和密码的代理，格式:http://username:password@proxy_ip:port"
echo "                      "
echo "#####例如: http://zhangsan:zhangsan@hzqing.com:8080"
echo "2、配置没有用户名和密码的代理，格式:http://proxy_ip:port"
echo "                     "
echo "#####例如: http://hzqing.com:8080"
echo "#################################################################"

echo "废话不多说，下面开始配置"
echo "                        "
#获取代理
read -p "请先输入代理（eg:http://hzqing.com:8080)" hproxy
echo "你输入的代理是：$hproxy"

read -p "请确认输入是否正确(y/n)? " istrue
while  [ $istrue != 'y' ] || [ $istrue != 'Y' ]
do
read -p "请先输入代理（eg:http://hzqing.com:8080)" hproxy
echo "你输入的代理是：$hproxy"

read -p "请确认输入是否正确(y/n)? " istrue

done

echo "11你输入的代理是：$hproxy"

#获取root密码
read -t 10 -s -p "请在10秒内输入root用户的密码: " rootpd




#配置系统代理
sysproxy=/home/hzq/linux/profile
#sysproxy=/etc/profile

read -p "是否设置系统变量（y/n)?" issysproxy

echo "你输入的是 $issysproxy"

if [ $issysproxy == 'y' ] || [ $issysproxy == 'Y' ]
then

echo "配置系统代理start..."

sudo echo "export http_proxy=$hproxy" >> $sysproxy
sudo echo "export ftp_proxy=$hproxy" >> $sysproxy
echo $?
echo "配置系统代理stop..."

fi
############################################################################################################################################################
############################################################################################################################################################
#配置yum代理

#yumproxy=/etc/yum.conf
yumproxy=$sysproxy

echo "配置yum代理start"

#proxy=http://username:password@proxy_ip:port/ 
sudo echo "proxy=$hproxy" >> $yumproxy

echo "配置yum代理end..."

############################################################################################################################################################
############################################################################################################################################################
#
#
#配置wget代理
#############################################
#开启配置wget代理
#wgetproxy=/etc/wgetrc
#############################################
#测试shell脚本用的
wgetproxy=$sysproxy

sudo echo "use_proxy = on" >> $wgetproxy
sudo echo "http_proxy=$hproxy" >> $wgetproxy
sudo echo "ftp_proxy=$hproxy" >> $wgetproxy


############################################################################################################################################################
############################################################################################################################################################
